src/Documents/Релиз/Релиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Релиз</name>
  <registerRecords>InformationRegister.Релизы</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРелиза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolsWorld</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Aelita</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКонфигурация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРазработки</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияОбъектаРазработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Слияния</name>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Версии</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКоммита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗадачиРелиза</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Постановщик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Релизы/Релизы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Релизы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВерсияОбъектаРазработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРазработки</name>
    <type>
      <types>CatalogRef.ОбъектыРазработки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиРелиза/ЗадачиРелиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиРелиза</name>
  <resources>
    <name>Принял</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Принята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НетЗадачиВГит</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НетЗадачиВБитрикс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>DocumentRef.Релиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыЗадач/ТипыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗадач</name>
  <enumValues>
    <name>ЗНИ</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Инцидент</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОбъектыРазработки/ОбъектыРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыРазработки</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ТипОбъектаРазработки</name>
    <type>
      <types>EnumRef.ТипыОбъектовРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияВерсий</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВерсии</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Релиз/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ОбъектыРазработки.Загрузить(ДанныеЗаполнения.ОбъектыРазработки);
		Для Каждого Строка Из ОбъектыРазработки Цикл
			Строка.ВерсияОбъектаРазработки = Формат(Дата, "ДФ=yyyyMMdd");
		КонецЦикла;
		
		Для Каждого Элемент Из ДанныеЗаполнения.ОбъектыРазработки Цикл
			
			ИнформацияОВерсии = ОбщегоНазначения.JSONВЗначение(Элемент.ИнформацияОВерсии);
			Для Каждого Коммит Из ИнформацияОВерсии Цикл
				НоваяСтрока = Версии.Добавить();
				НоваяСтрока.ИдентификаторКоммита = Коммит.Ключ; 
				НоваяСтрока.ОбъектРазработки = Элемент.ОбъектРазработки; 
				НоваяСтрока.Название = Элемент.Название; 
				НоваяСтрока.ДатаИзменения = ПрочитатьДатуJSON(Коммит.Значение["ДатаКоммита"], ФорматДатыJSON.ISO); 
				НоваяСтрока.ОписаниеИзменения = Коммит.Значение["ЗаголовокКоммита"]; 
				НоваяСтрока.Автор = Справочники.НастройкиПользователей.ПользовательПоЭлектроннойПочте(
					Коммит.Значение["Автор"]
				);
				НомерЗадачи = Лев(НоваяСтрока.ОписаниеИзменения, 6);
				Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерЗадачи) Тогда
					ГруппаРезультатаПоискаПоРегулярномуВыражению = СтрНайтиПоРегулярномуВыражению(
						НоваяСтрока.ОписаниеИзменения, "\d+_(\d+)").ПолучитьГруппы();
					Если ГруппаРезультатаПоискаПоРегулярномуВыражению.Количество() Тогда
						НомерЗадачи = ГруппаРезультатаПоискаПоРегулярномуВыражению[0].Значение;
					КонецЕсли;
				КонецЕсли;
				Попытка
					НоваяСтрока.Задача = Справочники.Задачи.НоваяЗадача(НомерЗадачи);
				Исключение
					ЗаписьЖурналаРегистрации("Релиз.СозданиеЗадачи", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
				КонецПопытки;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаЗадач = Версии.Выгрузить();
	ТаблицаЗадач.Свернуть("Задача");
	ЗадачиРелиза.Загрузить(ТаблицаЗадач);
	Версии.Сортировать("ДатаИзменения Убыв"); 
	НайденнаяСтрока = ЗадачиРелиза.Найти(Справочники.Задачи.ПустаяСсылка(), "Задача");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		ЗадачиРелиза.Удалить(НайденнаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Релизы.Записывать = Истина;
	Для Каждого ТекСтрокаОбъектыРазработки Из ОбъектыРазработки Цикл
		Движение = Движения.Релизы.Добавить();
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.ОбъектРазработки = ТекСтрокаОбъектыРазработки.ОбъектРазработки;
		Движение.ВерсияОбъектаРазработки = ТекСтрокаОбъектыРазработки.ВерсияОбъектаРазработки;
	КонецЦикла;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗадачиРелиза");
	ЭлементБлокировки.УстановитьЗначение("Релиз", Ссылка);
	Блокировка.Заблокировать(); 
	
	ЗадачиПоКоммитам = ЗадачиРелиза.Выгрузить();
	ТаблицаСопоставленныхЗадач = СопоставитьЗадачи();
	Для Каждого Элемент Из ТаблицаСопоставленныхЗадач Цикл
		РегистрыСведений.ЗадачиРелиза.ДобавитьЗаписиПоЗадачамРелиза(Ссылка, Элемент.Задача, 
			Элемент.НетЗадачиВГит, Элемент.НетЗадачиВБитрикс);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОбъектыРазработкиВТабличнойЧасти() Экспорт

	ОбъектыРазработкиПоследнихРелизов = РегистрыСведений.Релизы.ОбъектыРазработкиПоследнихРелизов(Проект);
	ВсеОбъектыРазработки = Справочники.ОбъектыРазработки.ДанныеПоПроекту(Проект);
	ИзмененныеОбъектыРазработки = ИзмененныеОбъектыРазработки(ОбъектыРазработкиПоследнихРелизов, ВсеОбъектыРазработки);
	
	ОбъектыРазработки.Загрузить(ИзмененныеОбъектыРазработки);
	
КонецПроцедуры

Процедура СоздатьНедостающиеОбъекты() Экспорт
	
	ПутьКПапке = Справочники.Проекты.ПутьКПапкеСборкиОбработок(Проект);

	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектРазработки", Справочники.ОбъектыРазработки.ПустаяСсылка());
	СписокОбработок = ОбъектыРазработки.Выгрузить(Отбор);
	
	Для Каждого Элемент Из СписокОбработок Цикл
		
		Файлы = НайтиФайлы(ПутьКПапке, СтрШаблон("%1.*", Элемент.Название));
		Если Файлы.Количество() Тогда
			ОбработкаСсылка = Справочники.ОбъектыРазработки.НайтиПоНаименованию(Элемент.Название);
			Если ОбработкаСсылка.Пустая() Тогда
				
				НовыйОбъект = Справочники.ОбъектыРазработки.СоздатьЭлемент();
				НовыйОбъект.Заполнить(Неопределено);
				НовыйОбъект.Владелец = Проект;
				НовыйОбъект.ТипОбъектаРазработки = РаботаСОбъектами.ТипОбъектаРазработкиПоФайлу(Файлы[0]);
				НовыйОбъект.Наименование = Элемент.Название;
				НовыйОбъект.Записать();
				ОбработкаСсылка = НовыйОбъект.Ссылка;
				
			КонецЕсли;
			
			НужнаяСтрока = ОбъектыРазработки.Найти(Элемент.Название);
			НужнаяСтрока.ОбъектРазработки = ОбработкаСсылка;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Название", Элемент.Название);
			
			СтрокиВерсий = Версии.НайтиСтроки(Отбор);
			ПоменятьВерсии(СтрокиВерсий, ОбработкаСсылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзмененныеОбъектыРазработки(ОбъектыРазработкиПоследнихРелизов, ВсеОбъектыРазработки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВсеОбъектыРазработки.ОбъектРазработки КАК ОбъектРазработки,
	|	ВсеОбъектыРазработки.Версия КАК Версия
	|ПОМЕСТИТЬ втВсеОбъектыРазработки
	|ИЗ
	|	&ВсеОбъектыРазработки КАК ВсеОбъектыРазработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРазработкиПоследнихРелизов.ОбъектРазработки КАК ОбъектРазработки,
	|	ОбъектыРазработкиПоследнихРелизов.ВерсияОбъектаРазработки КАК ВерсияОбъектаРазработки
	|ПОМЕСТИТЬ втОбъектыРазработкиПоследнихРелизов
	|ИЗ
	|	&ОбъектыРазработкиПоследнихРелизов КАК ОбъектыРазработкиПоследнихРелизов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеОбъектыРазработки.ОбъектРазработки КАК ОбъектРазработки,
	|	втВсеОбъектыРазработки.Версия КАК ВерсияОбъектаРазработки
	|ИЗ
	|	втВсеОбъектыРазработки КАК втВсеОбъектыРазработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОбъектыРазработкиПоследнихРелизов КАК втОбъектыРазработкиПоследнихРелизов
	|		ПО втВсеОбъектыРазработки.ОбъектРазработки = втОбъектыРазработкиПоследнихРелизов.ОбъектРазработки
	|			И втВсеОбъектыРазработки.Версия = втОбъектыРазработкиПоследнихРелизов.ВерсияОбъектаРазработки
	|ГДЕ
	|	втОбъектыРазработкиПоследнихРелизов.ОбъектРазработки ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОбъектыРазработкиПоследнихРелизов", ОбъектыРазработкиПоследнихРелизов);
	Запрос.УстановитьПараметр("ВсеОбъектыРазработки", ВсеОбъектыРазработки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПоменятьВерсии(СтрокиВерсий, ОбработкаСсылка)
	
	Для Каждого Элемент Из СтрокиВерсий Цикл
		Элемент.ОбъектРазработки = ОбработкаСсылка;
	КонецЦикла;
	
КонецПроцедуры

Функция СопоставитьЗадачи()
	
	Таблица = НовыйТаблицаЗадач();
	
	Для Каждого Элемент Из ЗадачиРелиза Цикл
		
		Если ЗначениеЗаполнено(Элемент.Задача.ОсновнаяЗадача) Тогда
			ТипЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Задача.ОсновнаяЗадача, "ТипЗадачи");
			Если ТипЗадачи = Перечисления.ТипыЗадач.Разработка  Тогда
				ЗадачаРелиза = Элемент.Задача.ОсновнаяЗадача.ОсновнаяЗадача;
			Иначе
				ЗадачаРелиза = Элемент.Задача.ОсновнаяЗадача;
			КонецЕсли;
		Иначе
			ЗадачаРелиза = Элемент.Задача;
		КонецЕсли;
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.Задача = ЗадачаРелиза;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗадачиИзGit", Таблица);
	Запрос.УстановитьПараметр("ЗадачиИзБитрикс", Задача.СвязанныеЗадачи.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица1.Задача КАК Задача
	|ПОМЕСТИТЬ втПерваяЗадача
	|ИЗ
	|	&ЗадачиИзGit КАК Таблица1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица2.Задача КАК Задача
	|ПОМЕСТИТЬ втВтораяЗадача
	|ИЗ
	|	&ЗадачиИзБитрикс КАК Таблица2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втПерваяЗадача.Задача, втВтораяЗадача.Задача) КАК Задача,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втПерваяЗадача.Задача, ИСТИНА) = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетЗадачиВГит,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втВтораяЗадача.Задача, ИСТИНА) = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетЗадачиВБитрикс
	|ИЗ
	|	втПерваяЗадача КАК втПерваяЗадача
	|		ПОЛНОЕ СОЕДИНЕНИЕ втВтораяЗадача КАК втВтораяЗадача
	|		ПО втПерваяЗадача.Задача = втВтораяЗадача.Задача
	|
	|УПОРЯДОЧИТЬ ПО
	|	Задача";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТаблицаЗадач()
	
	ОписаниеЗадача = Новый ОписаниеТипов("СправочникСсылка.Задачи");
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Задача", ОписаниеЗадача, "Задача");
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#КонецЕсли
